In [1]:
import pandas as pd

# Creating the dataset directly inside Jupyter
data = {
    "Name": ["Ravi", "Priya", "Arjun", "Sara", "Tom"],
    "Age": [18, None, 17, 18, 19],
    "Marks": [85, 92, None, 78, None],
    "City": ["Hyderabad", None, "Bangalore", "Chennai", "Hyderabad"]
}

df = pd.DataFrame(data)

# Save CSV file
df.to_csv("students.csv", index=False)

print("students.csv file created successfully!")
df

students.csv file created successfully!

    Name   Age  Marks       City
0   Ravi  18.0   85.0  Hyderabad
1  Priya   NaN   92.0       None
2  Arjun  17.0    NaN  Bangalore
3   Sara  18.0   78.0    Chennai
4    Tom  19.0    NaN  Hyderabad

In [2]:
# Load the dataset again to show original data
df = pd.read_csv("students.csv")
print("Original Data:")
display(df)

# Fill missing values
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Marks'].fillna(df['Marks'].median(), inplace=True)
df['City'].fillna("Unknown", inplace=True)

print("After Handling Missing Values:")
display(df)

Original Data:

    Name   Age  Marks       City
0   Ravi  18.0   85.0  Hyderabad
1  Priya   NaN   92.0        NaN
2  Arjun  17.0    NaN  Bangalore
3   Sara  18.0   78.0    Chennai
4    Tom  19.0    NaN  Hyderabad

After Handling Missing Values:

C:\Users\rishi\AppData\Local\Temp\ipykernel_15004\1900647231.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\rishi\AppData\Local\Temp\ipykernel_15004\1900647231.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Marks'].fillna(df['Marks'].median(), inplace=True)
C:\Users\rishi\AppData\Local\Temp\ipykernel_15004\1900647231.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna("Unknown", inplace=True)

    Name   Age  Marks       City
0   Ravi  18.0   85.0  Hyderabad
1  Priya  18.0   92.0    Unknown
2  Arjun  17.0   85.0  Bangalore
3   Sara  18.0   78.0    Chennai
4    Tom  19.0   85.0  Hyderabad

In [3]:
df.drop("City", axis=1, inplace=True)

print("After Dropping City Column:")
display(df)

# Save cleaned data
df.to_csv("cleaned_students.csv", index=False)
print("✔ cleaned_students.csv saved!")

After Dropping City Column:

    Name   Age  Marks
0   Ravi  18.0   85.0
1  Priya  18.0   92.0
2  Arjun  17.0   85.0
3   Sara  18.0   78.0
4    Tom  19.0   85.0

✔ cleaned_students.csv saved!